Console.WriteLine("Составить программу, которая выводит на экран таблицу квадратов первых десяти чисел.");

for (int i = 1; i <= 10; i++)
{
    Console.WriteLine("{0} * {0} = {1}", i, i * i);   
}
